app/controllers/user_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "joaco"], ["password", "[FILTERED]"], ["created_at", "2022-06-16 13:35:34.366941"], ["updated_at", "2022-06-16 13:35:34.366941"]]
---
    def create
        @user = User.new(user_params)

        if @user.save